Revit 2024 API
MEPSystemType.LineWeight Property
 Indicates the weight that should override the line weight for all components in the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public int LineWeight { get; set; }
Visual Basic
Public Property LineWeight As Integer
	Get
	Set
Visual C++
public:
property int LineWeight {
	int get ();
	void set (int value);
}
See Also
MEPSystemType Class
Autodesk.Revit.DB Namespace